In [25]:
import pandas as pd

In [26]:
h3=[[1,2,3]]
h3

[[1, 2, 3]]

In [27]:
f=pd.DataFrame(h3,index=[1],columns=[5,2,6])
f

   5  2  6
1  1  2  3

In [28]:
h3=[[1,2,3],[2,5,3]]

[[1, 2, 3], [2, 5, 3]]

In [30]:
pd.DataFrame(h3)

   0  1  2
0  1  2  3
1  2  5  3

In [32]:
h4 = { 
    'name' : ['이현','도연','도훈'],
    'gender' : ['f','f','m']
}

In [33]:
pd.DataFrame(h4)

  name gender
0   이현      f
1   도연      f
2   도훈      m